---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DimLineExtension
source: html/4af47e58-5994-561c-5349-f3fccad2e2f5.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DimLineExtension Property

"Dimension Line Extension"

## Syntax (C#)
```csharp
public static ForgeTypeId DimLineExtension { get; }
```